In [2]:
import pandas as pd

***Criando DataFrame***

In [3]:
df1 = pd.DataFrame()

In [4]:
df1

Empty DataFrame
Columns: []
Index: []

In [5]:
type(df1)

pandas.core.frame.DataFrame

In [6]:
dict1 = {'id': [1,2,3,4,5],
         'nome': ['André', 'Caio','Fernando','Rodrigo','Manuela']}

In [7]:
dict1

{'id': [1, 2, 3, 4, 5],
 'nome': ['André', 'Caio', 'Fernando', 'Rodrigo', 'Manuela']}

In [8]:
df2 = pd.DataFrame(data = dict1)

In [9]:
df2

   id      nome
0   1     André
1   2      Caio
2   3  Fernando
3   4   Rodrigo
4   5   Manuela

In [10]:
df3 = df2 = pd.DataFrame(data = dict1, index =[45,55,65,75,85])

In [11]:
df3

    id      nome
45   1     André
55   2      Caio
65   3  Fernando
75   4   Rodrigo
85   5   Manuela

In [12]:
serie1 = pd.Series([1,2,3,4,5])

In [13]:
serie1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [14]:
type(serie1)

pandas.core.series.Series

In [15]:
serie2 = pd.Series(['a','b','c'])

In [16]:
df4 = pd.DataFrame({'coluna1': serie1,
                    'coluna2': serie2})

In [17]:
df4

   coluna1 coluna2
0        1       a
1        2       b
2        3       c
3        4     NaN
4        5     NaN

In [18]:
import numpy as np

In [22]:
array1 = np.array([['1','2','3'],
                  ['São Paulo','CEARÁ','BAHIA'],
                  ['SP','CE','BA']], dtype='<U14')

In [23]:
type(array1)

numpy.ndarray

In [28]:
df5 = pd.DataFrame(data = array1.transpose(),
                   index =['linha1', 'linha2', 'linha3'],
                   columns = ['identificacao','cidade','estado'])

In [29]:
df5

       identificacao     cidade estado
linha1             1  São Paulo     SP
linha2             2      CEARÁ     CE
linha3             3      BAHIA     BA

In [33]:
matriz1 = np.matrix([['1','2','3'],
                  ['São Paulo','CEARÁ','BAHIA'],
                  ['SP','CE','BA']])

In [34]:
type(matriz1)

numpy.matrix

In [35]:
df6 = pd.DataFrame(data = matriz1.transpose(),
                   index =['linha1', 'linha2', 'linha3'],
                   columns = ['identificacao','cidade','estado'])

In [36]:
df6

       identificacao     cidade estado
linha1             1  São Paulo     SP
linha2             2      CEARÁ     CE
linha3             3      BAHIA     BA